In [44]:
import pandas as pd
from datetime import datetime
import os

In [4]:
target_path = r'C:\Users\anchi\my_programs\data_hub\archive(2)'

In [5]:
transaction_df = pd.read_csv(os.path.join(target_path, 'transaction_data.csv'))

In [6]:
transaction_df.shape

(2595732, 12)

In [7]:
transaction_df.columns

Index(['household_key', 'BASKET_ID', 'DAY', 'PRODUCT_ID', 'QUANTITY',
       'SALES_VALUE', 'STORE_ID', 'RETAIL_DISC', 'TRANS_TIME', 'WEEK_NO',
       'COUPON_DISC', 'COUPON_MATCH_DISC'],
      dtype='object')

In [13]:
transaction_df.head()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,RETAIL_DISC,TRANS_TIME,WEEK_NO,COUPON_DISC,COUPON_MATCH_DISC
0,2375,26984851472,1,1004906,1,1.39,364,-0.60,1631,1,0.0,0.0
1,2375,26984851472,1,1033142,1,0.82,364,0.00,1631,1,0.0,0.0
2,2375,26984851472,1,1036325,1,0.99,364,-0.30,1631,1,0.0,0.0
3,2375,26984851472,1,1082185,1,1.21,364,0.00,1631,1,0.0,0.0
4,2375,26984851472,1,8160430,1,1.50,364,-0.39,1631,1,0.0,0.0

In [84]:
transaction_df.isna().sum()
list(transaction_df['WEEK_NO'].unique())

[1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 35,
 34,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100,
 101,
 102]

In [51]:
# transaction_df['DAY'].unique()

In [89]:
def get_timestamp(week, day, time):
    x = day if day <= 365 else day-365
    wk= week if week <= 52 else week - 52
    str_date = ''
    if (len(str(int(time))) == 0) or (len(str(int(time))) == 1):
        str_date = '2017' + "-" + str(int(wk)) + "-" + str(int(x)) + 'T' + str(int(time)) + '0Z'
#         d = datetime.strptime(str_date, "%Y-%W-%jT%H%MZ")
    else:
        str_date = '2017' + "-" + str(int(wk)) + "-" + str(int(x)) + 'T' + str(int(time)) + 'Z'

    return datetime.strptime(str_date, "%Y-%W-%jT%H%MZ")

In [90]:
# pd.to_datetime('2017-'+transaction_df['WEEK_N/O'].astype(str)+'-'+transaction_df['DAY'].astype(str), format='%Y-%W-%w').dt.strftime('%Y-%m-%d')
transaction_df['timestamp'] = transaction_df.apply(lambda x : get_timestamp(x['WEEK_NO'], x['DAY'], x['TRANS_TIME']), axis = 1)

In [91]:
transaction_df.head()

,household_key,BASKET_ID,DAY,PRODUCT_ID,QUANTITY,SALES_VALUE,STORE_ID,RETAIL_DISC,TRANS_TIME,WEEK_NO,COUPON_DISC,COUPON_MATCH_DISC,timestamp
0,2375,26984851472,1,1004906,1,1.39,364,-0.60,1631,1,0.0,0.0,2017-01-01 16:31:00
1,2375,26984851472,1,1033142,1,0.82,364,0.00,1631,1,0.0,0.0,2017-01-01 16:31:00
2,2375,26984851472,1,1036325,1,0.99,364,-0.30,1631,1,0.0,0.0,2017-01-01 16:31:00
3,2375,26984851472,1,1082185,1,1.21,364,0.00,1631,1,0.0,0.0,2017-01-01 16:31:00
4,2375,26984851472,1,8160430,1,1.50,364,-0.39,1631,1,0.0,0.0,2017-01-01 16:31:00

In [8]:
product_df = pd.read_csv(os.path.join(target_path, 'product.csv'))

In [10]:
product_df.columns

Index(['PRODUCT_ID', 'MANUFACTURER', 'DEPARTMENT', 'BRAND', 'COMMODITY_DESC',
       'SUB_COMMODITY_DESC', 'CURR_SIZE_OF_PRODUCT'],
      dtype='object')

In [11]:
demographic_df = pd.read_csv(os.path.join(target_path, 'hh_demographic.csv'))

In [12]:
demographic_df.columns

Index(['AGE_DESC', 'MARITAL_STATUS_CODE', 'INCOME_DESC', 'HOMEOWNER_DESC',
       'HH_COMP_DESC', 'HOUSEHOLD_SIZE_DESC', 'KID_CATEGORY_DESC',
       'household_key'],
      dtype='object')